{
  
    "URL" :"http://192.168.6.8:3001/",
    "LogInCredentials": {
        "email": "saagar@gmail.com",
        "password": "Vijay@123"
    },
    "BasicInfo": {
        "userFirstName": "vijay",
        "userSecondName": "anand",
        "experiance": "3",
        "role": "QA Engineer"
    },
    "SummaryPoint": [

        "Highly motivated QA Engineer having experience in both Manual & Automation testing. Expertise in testing Web and API using Tools like Selenium Web Driver and Rest Assured with JAVA as programming language. Experienced in Frameworks like TestNG, Cucumber. and Page Object Model Framework(Web Automation)",

        "Hands-on experience and strong understanding of various Software Development Life Cycle (SDLC) like Waterfall, V- Model, Agile and Software Testing Life Cycle (STLC) ",

        "Expert in different types of testing that includes Black Box testing Smoke testing,Functional testing, System Integration testing,End-to- End Testing, Regression testing & User Acceptance testing (UAT) & Involved in Load Testing, Performance Testing & Stress Testing",

        "Have Good Knowledge on Performance Testing using J Meter tool",

        "Collaborated with cross-functional teams like developers, business analysts, and other stakeholders to ensure that testing activities are aligned with ",
        
        "Maintained Documents of all testing activities like test cases, Traceability Matrix, Test Data, Bug Report, Regression Suite execution results",
        
        "Established the Jenkins continuous integration environment for the regression suite and executed them on weekly basis on the Virual machines.",

        "Used JIRA, Test-rail and Trello bug tracking tools to log, track and manage defects.",

        "Ability to Effectively communicate testing activities and findings in oral and written formats with Excellent Communication skills."

    ],
    "EducationData": {
        "Degree" :"B Tech",
        "FieldOfStudy":"Computer Science Engineering",
        "Year":"2019"
},
    "TechSkills": {
        "techName": ["java","javaScript","Selenium","Appium","playWright"],
        "dataBaseName": ["SQL","MY SQL"],
        "AWSName": ["Vijay","CodePipeline"],
        "ProjectManagementToolName": ["Trello","Click Up","Jira"],
        "sourceControllName": ["Git","Git Hub"]
    },

    "ProjectName": {
        "projectName": "affitu",
        "technologyName": "Appium Automation and API testing "
        
    },
    "Responsibilities": [
        "Developed test cases and test scenarios based on requirement.",

        "Perform manual testing for Mobile and Web application. Identifying and report bugs, issues, and inconsistencies.",
        
        "Involved in Preparation of Test Procedures, Test Scenarios, Test Cases and Test Data for Functional Testing, Integration Testing, End-to-End Testing and Smoke Testing.",
       
        "Used Agile for Release planning, Iteration planning, Sprint and Backlog.",
       
        "Performed browser compatibility and configuration testing on various operating systems such as Windows, Linux/Unix and iOS OS etc.",
        
        "Experience with tools such as Selenium with java (BDD Cucumber Framework,TestNG and Page Object Model Framework).",
        
        "Expert in different types of testing that includes Black Box testing : Smoke testing, Functional testing, System Integration testing, End-to- End Testing,Regression testing & User Acceptance testing (UAT) & Involved in Load Testing,Performance Testing & Stress Testing."
    ],
    "Descriptions": [
        "Affitu is a mobile application to manage rented properties. Landlords can add their rented property details once and map tenants It allows landlords to generate rent bills to tenants who are mapped to their rented property and send it via e-mail to the tenants. Landlord can download the rent statement or they can get it via email",
       
        "Tenants can do online rent payments and can view the rent bills and the rent receipts generated by the landlords ,Landlords can upload documents once and share it with the tenants. This app allows landlords to make announcement to all the tenants residing in a rented property and allows tenants to notify any property related problems/complaints to the owner"
        
    ],
    "Duration": {
        "months": "1 years"
    },

    "ProjectName1": {
        "projectName": "Utiliko",
        "technologyName": "Manual Testing, Selenium WebDriver with Java, Postman (APITesting). "
    },
    "Responsibilities1":[

        "Managed a team of 4 software testers to ensure quality assurance for a range of software products.",

        "Developed, maintained, and executed test plans for various projects.",

        "Monitored bug reports and tracked progress to ensure timely resolution",

        "Assisted in developing and updating test cases and test scripts.",

        "Conducted usability testing to identify user experience issues.",

        "Provided training and mentorship to junior testers,Created reports and presentations to communicate test results to stakeholders.Performed exploratory testing and regression testing to identify software defects.",

        "Established and maintained strong relationships with stakeholders and other QA teams, Analyzed current process and developed test strategies to improve overall quality"
    ],

    "Descriptions1": [

        "Utiliko is an CRM application, Utiliko application has own mailbox to send mail with all option. All type of industry can use this application ,User can track income, expense detail easily through modules and user can able to create estimates, invoices, purchase order",

        "Payment integration also part of application with CC/ACH. Policy based login implemented in all over application Utiliko application have accounting, HR management, custom fields, Permission based login, client login.  User can able to upload file in cloud and can main those details in file manager."
    ],
    "Duration1": {
        "months": "1 years"
    }

}